{
    "bienvenida": ["a"],
    
    "aprendizaje": ["Un computador es un sistema secuencial sincrono complejo que procesa informacion. La informacion dentro del ordenador se trata de forma binaria, utilizando solamente los digitos o valores logicos uno y cero, al contrario que el sistema metrico decimal habitual formado por digitos del cero al nueve.", 
                     "Para empezar a describir la estructura basica de un computador, cabe definir las funciones que se espera que pueda realizar una maquina denominada como tal. En terminos generales un computador tiene que realizar tres funciones: ",
                     "Procesamiento de datos. Almacenamiento de datos. Transferencia de datos",
                     "El computador debe procesar datos, transformando la informacion recibida. Asi mismo debe almacenar datos. tanto resultados de computaciones intermedias, como el resultado final de estas. De la misma manera el computador debe realizar transferencia de datos entre su entorno y el mismo. Para realizar estas tres funciones es necesario un mecanismo de control que gobierne el flujo de datos entre los diversos modulos."],
    
    
    "unidad central de proceso": ["La unidad central de proceso controla el funcionamiento de todos los elementos del computador. Controla el flujo de datos, los procesa, y gobierna el secuenciamiento y las acciones en todo el sistema.",
                                  "Una CPU básica consta principalmente de las siguientes unidades","Unidad de Control UC. Unidad Aritmetico Logica ALU. Registros internos",
                                  "La UNIDAD DE CONTROL UC, se encarga de leer de la memoria las instrucciones que se debe ejecutar y de secuenciar el acceso a los datos y las operaciones a realizar por la unidad de proceso. Se encarga de acceder a memoria habilitando un camino de datos para que las instrucciones y los datos lleguen a la CPU.",
                                  "La Unidad Aritmetico Logica ALU, es la parte de la CPU encargada de realizar las transformaciones de los datos. La ALU consta de una serie de modulos que permiten realizar operaciones aritmeticas y logicas.",
                                  "Los registros internos son pequeñas memorias de alta velocidad dentro de un computador que se utilizan para almacenar datos temporales y realizar operaciones rapidas."],
    "memoria": ["En la memoria se almacenaran el programa y los datos que, provenientes de un dispositivo de Entrada Salida o dispositivos de almacenamiento secundario, va a ejecutar la CPU. La matriz de memoria está organizada en palabras, cada una de las cuales tiene asignada una direccion que indica su posicion en la matriz.",
                "La memoria en un computador es un dispositivo electrónico que almacena temporalmente programas y datos que están siendo utilizados por el procesador, para acceder a ellos más rapidamente."],
    "entrada salida": ["Un computador tiene una gran cantidad de dispositivos de entrada y salida. Desde un teclado hasta un monitor de video, pasando por un disco duro, todos son dispositivos que la CPU necesita para obtener datos o para almacenar o mostrar resultados.",
                       "El principal problema de estos dispositivos perifericos es su gran variedad. Muchos de ellos comunican a un operador humano con el computador y otros sirven de conexion con otros computadores.",
                       "El objetivo de cada transferencia es llevar los datos desde el periferico a una zona concreta de la memoria y viceversa."],  
    "sistemas de interconexión buses": ["La conexion entre los diversos componentes de un computador se efectua fisicamente a traves de los buses. Un bus se define como un enlace de comunicacion compartido que usa multiples cables para conectar subsistemas.",
                                        "Cada linea es capaz de transmitir una tensión electrica que representa un uno o un cero binario.",
                                        "Las señales de los buses estan agrupadas siguiendo un criterio de funcionalidad:",
                                        "Bus de datos. Bus de direcciones. Bus de control. Bus de alimentacion",
                                        "Los buses de datos son las iineas por las que se transmiten los datos entre los diversos dispositivos que forman el computador.",
                                        "Los buses de direcciones sirven para indicar a la memoria o al resto de dispositivos la posicion del dato que se quiere acceder.",
                                        "Los buses de control agrupan todas las señales de control que gobiernan el acceso al bus de datos y direcciones. Agrupa señales de lectura, escritura, arbitraje, entre otros.",
                                        "Los buses de alimentacion son los cables o conexiones que suministran energia electrica a los componentes internos del equipo, como la placa madre, la CPU, las tarjetas de expansion y los dispositivos de almacenamiento."],
    "perifericos": ["Los perifericos son todos aquellos dispositivos que sin ser imprescindibles en la estructura de un computador, son necesarios para suministrar datos a la maquina o visualizar los resultados.",
                    "Los periféricos de entrada de datos son interruptores, teclados, ratones, pantallas graficas interactivas y digitalizadores de imagenes (escaners)."],
    "PE PREGUNTA 01": ["PRIMERA PREGUNTA: ¿Cual es el objetivo principal del pensamiento computacional?",
                       "a) Resolver problemas utilizando algoritmos y abstraccion. b) Programar robots y sistemas autonomos. c) Diseñar hardware de computadoras."],
    "PE PREGUNTA 02": ["SEGUNDA PREGUNTA: 2. El primer paso del pensamiento computacional es: identificar el problema.",
                       "¿VERDADERO? o ¿FALSO?"],
    "PE PREGUNTA 03": ["TERCERA PREGUNTA: ¿Qué es un algoritmo en terminos de pensamiento computacional?",
                       "1) Un patron de diseño visual 2) Un lenguaje de programacion 3) Una secuencia de pasos para resolver un problema 4) Una representacion grafica de datos"],
    "preguntas": [
        {
            "pregunta": "Que tipo de informacion procesa un computador de forma binaria?",
            "opciones": ["a) Informacion metrica decimal", "b) Informacion en digitos logicos 1 y 0", "c) Informacion en digitos del 0 al 9"],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Que componente del computador esta formado por millones de transistores y opera a frecuencias de cientos de MHz?",
            "opciones": ["a) Memoria RAM", "b) Disco duro", "c) Unidad de procesamiento central"],
            "respuesta_correcta": "c"
        },
        {
            "pregunta": "Cual es la tension electrica asociada a un valor logico '1' en un sistema binario?",
            "opciones": [
                "a) 3.3 voltios",
                "b) 0 voltios",
                "c) 5 voltios"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Por que es esencial la naturaleza jerarquica en sistemas complejos?",
            "opciones": [
                "a) Facilita la comunicacion con el mundo exterior",
                "b) Simplifica la organizacion de los componentes",
                "c) Permite abordar un nivel del sistema a la vez"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Cual es el proposito de una caracterizacion abstracta y simplificada en un sistema jerarquico?",
            "opciones": [
                "a) Describir el sistema en detalle",
                "b) Representar el sistema en el nivel inferior",
                "c) Facilitar la interaccion entre componentes"
            ],
            "respuesta_correcta": "c"
        },
        {
            "pregunta": "Cual es la diferencia principal entre las aproximaciones 'bottom-up' (desde abajo hacia arriba) y 'top-down' (desde arriba hacia abajo) para describir sistemas jerarquicos?",
            "opciones": [
                "a) La aproximacion 'bottom-up' comienza desde el nivel mas alto y desciende gradualmente",
                "b) 'Bottom-up' se enfoca en la descripcion de sistemas a nivel de componentes fisicos",
                "c) Ambas aproximaciones son identicas y se utilizan en la descripcion de sistemas jerarquicos"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Que tecnologia se utiliza en el nivel electronico para la construccion de circuitos integrados (CIs)?",
            "opciones": [
                "a) En el nivel electronico se utiliza la tecnologia de impresion 3D",
                "b) La tecnologia de muy alta escala de integracion (VLSI) se utiliza en el nivel electronico",
                "c) En el nivel electronico se utilizan materiales organicos"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "En el nivel digital, como se describe el estado de los sistemas y cuales son los elementos principales utilizados en este nivel?",
            "opciones": [
                "a) El estado de los sistemas se describe utilizando lenguaje natural",
                "b) El estado de los sistemas se describe mediante unos y ceros (informacion binaria)",
                "c) El estado de los sistemas se describe en base a colores y formas"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Que nivel de abstraccion se prefiere para describir computadoras en el texto?",
            "opciones": [
                "a) El nivel de abstraccion preferido es el nivel de componente",
                "b) El nivel de abstraccion preferido es el nivel PMS",
                "c) El nivel de abstraccion preferido es el nivel RTL (Nivel de Transferencia de Registros)"
            ],
            "respuesta_correcta": "c"
        },
        {
            "pregunta": "Que significa la sigla PMS en el contexto del nivel mas alto de la jerarquia de descripcion de computadoras?",
            "opciones": [
                "a) PMS significa 'Pantalla, Mouse, Teclado'",
                "b) PMS significa 'Processor Memory Switch' (Procesador, Memoria, Conmutador)",
                "c) PMS significa 'Programa de Manejo de Sistemas'"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Cuál es la función de la Unidad Central de Proceso (CPU) en un sistema de computación?",
            "opciones": [
                "a) Controlar el flujo de datos y procesarlos",
                "b) Almacenamiento de datos",
                "c) Transferencia de datos entre el entorno exterior y el computador"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Cuál es la función principal de la memoria en un sistema de computación?",
            "opciones": [
                "a) Almacenamiento de datos e instrucciones de programa",
                "b) Procesamiento de datos",
                "c) Control del flujo de datos y procesamiento"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Cuál es el papel del Sistema de interconexión (Buses) en un computador según el modelo Von Neumann?",
            "opciones": [
                "a) Facilitar el flujo de datos entre la CPU, la memoria y los módulos de E/S",
                "b) Almacenar datos de forma temporal",
                "c) Controlar el flujo de datos y procesarlos"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Cuáles son las tres funciones principales que debe realizar un sistema de computación?",
            "opciones": [
                "a) Procesamiento de datos, Almacenamiento de datos, Transferencia de datos",
                "b) Entrada de datos, Procesamiento de datos, Salida de datos",
                "c) Control de datos, Almacenamiento de datos, Transferencia de datos"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Qué es la unidad central de procesamiento (CPU)?",
            "opciones": [
                "a) El componente de hardware central de una computadora",
                "b) Responsable de solo interpretar las instrucciones de los programas informaticos",
                "c) Ninguna de las anteriores"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Cuál es una parte principal de la CPU?",
            "opciones": [
                "a) La unidad de contencion(UC)",
                "b) La unidad aritmetico-logica (ALU)",
                "c) Los registros externos"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Cuál es la función de la unidad de control?",
            "opciones": [
                "a) Interpretar las instrucciones de los programas",
                "b) Coordinar las operaciones de la memoria RAM",
                "c) Ninguna de las anteriores"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Cuál es la función de la unidad aritmetico-logica (ALU)?",
            "opciones": [
                "a) Realizar operaciones matematicas y logicas",
                "b) Interpretar instrucciones de programas",
                "c) Genera senales necesarias para que el CPU analice las instrucciones"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Cuáles son los registros internos principales de la CPU?",
            "opciones": [
                "a) Comparador de programas",
                "b) Registro de Instruccion",
                "c) Registros de Estado del CPU"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "En qué formato se almacenan las instrucciones y los datos en la memoria?",
            "opciones": [
                "a) En formato ASCII",
                "b) En formato binario",
                "c) En formato decimal"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Cuál es el proposito del diseño jerarquico de memoria?",
            "opciones": [
                "a) Reducir los costos de almacenamiento al utilizar una sola capa de memoria para todos los datos",
                "b) Minimizar la latencia y optimizar el rendimiento al organizar diferentes niveles de memoria con la mas rapida cerca de la CPU",
                "c) Se concede un acceso directo al CPU, dejando la memoria mas lenta en las capas mas internas para una mayor eficiencia"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Cuál es el proposito principal de la volatilidad de una memoria?",
            "opciones": [
                "a) Para almacenar informacion critica",
                "b) Acelerar el tiempo de acceso a la main memory",
                "c) Preservar datos e instrucciones despues de un corte de energia"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Qué relacion existe entre el tiempo de acceso y el precio por bit en las tecnologias de almacenamiento?",
            "opciones": [
                "a) Son independientes",
                "b) Son directamente proporcionales",
                "c) Son inversamente proporcionales"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Por qué los computadores no pueden tener toda la memoria implementada con el dispositivo mas rapido existente?",
            "opciones": [
                "a) Debido a restricciones de costo y rendimiento",
                "b) Limitaciones en el acceso de la memoria principal",
                "c) Limitaciones del CPU"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Por qué no se pueden conectar directamente los dispositivos perifericos a la CPU?",
            "opciones": [
                "a) Diversidad en tecnologia y funcionamiento",
                "b) Ahorro de espacio",
                "c) Mayor velocidad de transferencia"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Qué es el objetivo principal de las transferencias de entrada/salida?",
            "opciones": [
                "a) Mover datos entre la CPU y la memoria",
                "b) Mover datos entre los perifericos y la memoria",
                "c) Mover datos entre la CPU y los dispositivos de almacenamiento"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Qué funcion tienen los modulos de WS en relacion con los dispositivos perifericos?",
            "opciones": [
                "a) Almacenar datos temporales",
                "b) Facilitar la comunicacion entre la CPU y los perifericos",
                "c) Realizar operaciones aritmeticas"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Por qué cada control de periferico tiene una direccion unica en el sistema?",
            "opciones": [
                "a) Para confundir a la CPU",
                "b) Para ahorrar espacio en memoria",
                "c) Para permitir que la interfaz de WS detecte cuando se dirige a el"
            ],
            "respuesta_correcta": "c"
        },
        {
            "pregunta": "Qué factores influyen en el diseño de la interfaz de entrada/salida?",
            "opciones": [
                "a) El conjunto de instrucciones de la CPU",
                "b) La velocidad de los perifericos",
                "c) El color de la computadora"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Qué es un bus de datos?",
            "opciones": [
                "a) Un enlace de comunicacion compartido que usa multiples cables",
                "b) Un dispositivo para almacenar datos",
                "c) Un dispositivo que agrupa senales"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Para que se utiliza el bus de direcciones?",
            "opciones": [
                "a) Para transmitir datos entre dispositivos",
                "b) Para indicar la ubicacion de los datos que se desean acceder",
                "c) Para seleccionar el tipo de transaccion de bus"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Cual es la funcion del bus de control?",
            "opciones": [
                "a) Transmitir datos entre la CPU y la memoria",
                "b) Seleccionar el emisor y receptor en una transaccion de bus",
                "c) Alimentar los dispositivos conectados al bus"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Que provoca una contencion de bus?",
            "opciones": [
                "a) La transmision simultanea de senales por varios dispositivos",
                "b) La desconexion de los dispositivos del bus",
                "c) El aumento de la velocidad del bus"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Que representa una senal electrica en un bus de datos?",
            "opciones": [
                "a) Un '1' o un '0' binario",
                "b) Una letra o numero en codigo hexadecimal",
                "c) Una instruccion de control"
            ],
            "respuesta_correcta": "a"
        },
        {
            "pregunta": "Que son los perifericos en el contexto de una computadora?",
            "opciones": [
                "a) Componentes esenciales de la CPU",
                "b) Dispositivos que no son necesarios para la computadora",
                "c) Elementos fundamentales para el almacenamiento de datos"
            ],
            "respuesta_correcta": "c"
        },
        {
            "pregunta": "Como se conectan los perifericos a una computadora?",
            "opciones": [
                "a) A traves de un puerto USB",
                "b) Usando el mismo bus que conecta la CPU con la memoria",
                "c) Mediante un bus especial, el enlace de WS"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Por que los buses utilizados para conectar perifericos son diferentes de los que conectan el procesador con la memoria?",
            "opciones": [
                "a) Para mejorar el rendimiento de la CPU",
                "b) Porque los perifericos no requieren un bus de conexion",
                "c) Debido a las diferencias de rendimiento entre perifericos y CPU"
            ],
            "respuesta_correcta": "c"
        },
        {
            "pregunta": "Qué ejemplos de perifericos de entrada de datos se mencionan en el texto?",
            "opciones": [
                "a) Impresoras y monitores",
                "b) Ratones y teclados",
                "c) Cintas magneticas y discos duros"
            ],
            "respuesta_correcta": "b"
        },
        {
            "pregunta": "Qué categorias de dispositivos perifericos son esenciales para la interaccion del usuario con una computadora?",
            "opciones": [
                "a) Dispositivos de almacenamiento masivo",
                "b) Impresoras laser y plotters",
                "c) Terminales de video y tarjetas graficas"
            ],
            "respuesta_correcta": "c"
        }
    ]
}